# LAB 02 - Pandas

## 04 데이터 확인하기

### 라이브러리 참조하기

In [2]:
from hossam import load_data

### 데이터 가져오기
가상의 과목별 점수 데이터 불러오기

In [3]:
origin = load_data('GRADE')
origin

[data] https://data.hossam.kr/data/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### 데이터 구조 확인
데이터의 차원과 크기

In [4]:
print("차원:",origin.ndim)
print("크기:",origin.shape)

차원: 2
크기: (9, 6)

### 데이터 구조 확인
각 필드별 데이터 타입과 정보 확인

In [5]:
origin.dtypes
origin.info

<bound method DataFrame.info of     학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80>

### 데이터 내용 확인
특정 열의 데이터 확인 (타입은 Series 타입)

In [6]:
origin['국어']
type(origin['국어'])

pandas.core.series.Series

### 데이터 내용 확인
원하는 열 일괄적으로 추출하기 > 대괄호를 이중으로 표현

In [7]:
df2 = origin[['국어','영어','수학']]
df2

    국어   영어  수학
이름
철수  98   77  88
영희  88  120  62
민철  92   70  83
수현  63   60  31
호영  75   50  90
영호  80   88  91
용식  82   88  79
나영  90   92  81
석영  91   90  89

### 특정 행에 접근하기
- 인덱스 이름으로 접근하기 (이름기반의 접근은 loc)
- 특정 행의 데이터 타입은 Series 타입임 (시리즈 객체의 모든 메서드 활용 가능)

In [8]:
origin.loc['철수']

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [9]:
type(origin.loc['철수'])

pandas.core.series.Series

### 특정 행에 접근하기
- 인덱스 번호를 기반으로 접근 (iloc 은 인덱스 번호 기반)
- 인덱스 번호로 접근하면 슬라이싱도 가능함

In [11]:
origin.iloc[0]

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [13]:
origin.iloc[0:4]

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71

### 단일 값 확인하기
- 열>행 순서로 접근할 때는 [][]
- 행>열 순서로 접근할떄는 [a,b]

In [14]:
#1번쨰 행의 2번쨰 열 데이터
origin.iloc[1,2]

np.int64(88)

### 단일 값 확인하기
- 인덱스 기반의 데이터 접근 시에는 행>열 순서
- 인덱스 번호 기반의 접근이면 슬라이싱 가능

In [ ]:
#모든 행에서 3번쨰 열만 가져옴
origin.iloc[:,3]

### 값의 변경
- 값을 변경할 떄는 행>열 순으로 접근하는 경우만 변경이 가능함

In [ ]:
origin.loc['철수','국어'] = 100
origin

### 데이터 일부만 확인하기
- 상위 데이터 확인 시에는 head
- 하위 데이터 확인 시에는 tail

In [17]:
#상위 데이터 확인
origin.head(2)

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72

In [18]:
#하위 데이터 확인
origin.tail(2)

    학년  성별  국어  영어  수학  과학
이름
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

### 기초 통계량 확인
- 데이터 프레임은 기본적으로 시리즈 객체이므로 기술 통계량 관련 메서드를 모두 사용할 수 있음

In [ ]:
print("합계:", origin['국어'].sum())
print("평균:", origin['국어'].mean())
print("최대:", origin['국어'].max())
print("최소:", origin['국어'].min())
print("분산:", origin['국어'].var())
print("표준편차:", origin['국어'].std())
print("중앙값:", origin['국어'].median())
print("1사분위 수:", origin['국어'].quantile(0.25))
print("2사분위 수:", origin['국어'].quantile(0.5))
print("3사분위 수:", origin['국어'].quantile(0.75))

### 데이터 프레임 단위의 기초 통계량 확인
모든 컬럼에 대해 일괄적으로 계산이 가능하고, 계산할 수 없는 형태의 값도 계산되므로 주의가 필요하다

In [20]:
origin.sum()

학년                    19
성별    남자여자남자여자남자남자남자여자남자
국어                   761
영어                   735
수학                   694
과학                   711
dtype: object

### descibe 메서드로 컬럼 단위의 기술 통계량 일괄 산출 가능

In [21]:
origin['국어'].describe

<bound method NDFrame.describe of 이름
철수    100
영희     88
민철     92
수현     63
호영     75
영호     80
용식     82
나영     90
석영     91
Name: 국어, dtype: int64>

### 데이터 프레임 단위로 일괄 산출
- 연산이 가능한 컬럼만 추출

In [22]:
df2 = origin[['국어','영어','수학','과학']]
desc  =df2.describe()
desc

               국어          영어         수학         과학
count    9.000000    9.000000   9.000000   9.000000
mean    84.555556   81.666667  77.111111  79.000000
std     10.955719   20.481699  19.451507  10.283482
min     63.000000   50.000000  31.000000  64.000000
25%     80.000000   70.000000  79.000000  72.000000
50%     88.000000   88.000000  83.000000  79.000000
75%     91.000000   90.000000  89.000000  88.000000
max    100.000000  120.000000  91.000000  95.000000

### 전치 구하기
- 가로와 세로를 바꿔 새로운 데이터 프레임을 생성할 수 있음

In [23]:
t=desc.T
t

    count       mean        std   min   25%   50%   75%    max
국어    9.0  84.555556  10.955719  63.0  80.0  88.0  91.0  100.0
영어    9.0  81.666667  20.481699  50.0  70.0  88.0  90.0  120.0
수학    9.0  77.111111  19.451507  31.0  79.0  83.0  89.0   91.0
과학    9.0  79.000000  10.283482  64.0  72.0  79.0  88.0   95.0

### 범주형 데이터의 빈도수 구하기
- value_counts 를 활용하면 각 범주의 빈도수를 구할 수 있다

In [24]:
origin['성별'].value_counts()

성별
남자    6
여자    3
Name: count, dtype: int64

In [25]:
origin['학년'].value_counts()

학년
1    4
2    2
4    2
3    1
Name: count, dtype: int64

데이터프레임은 즉 시리즈를 이어 붙인것

가로 세로가 모두 시리즈타입


인덱스 번호로 iloc > 슬라이싱도 가능
항상 열 우선


리스트랑은 조금 달라

열행 순서면 a [] []
행렬 순서면 loc 써야하고 [ , ]
인덱스 번호 기반이면 iloc


값을 바꿀떄는 행렬로 접근할때만가능